In [1]:
import sqlite3 as sq
import pandas as pd

In [2]:
con = sq.connect("hr.db")
con

In [4]:
cur = con.cursor()
cur

In [6]:
results = cur.execute("select name from sqlite_master where type='table'")
results.fetchall()

[('employee',)]

In [13]:
sales = pd.read_sql("""select EmployeeNumber, Department, Age, Gender, Attrition
                    from employee
                    where Department = 'Sales'""", con)
sales

     EmployeeNumber Department  Age  Gender Attrition
0                 1      Sales   41  Female       Yes
1                23      Sales   53  Female        No
2                27      Sales   36    Male       Yes
3                35      Sales   42    Male        No
4                38      Sales   46  Female        No
..              ...        ...  ...     ...       ...
441            2046      Sales   45  Female      None
442            2055      Sales   50    Male      None
443            2056      Sales   39  Female      None
444            2060      Sales   26  Female      None
445            2065      Sales   49    Male        No

[446 rows x 5 columns]

In [14]:
field = pd.read_sql("""select EmployeeNumber, EducationField, Age, Gender, Attrition
                    from employee
                    where EducationField = 'Life Sciences'""", con)
field

     EmployeeNumber EducationField  Age  Gender Attrition
0                 1  Life Sciences   41  Female       Yes
1                 2  Life Sciences   49    Male        No
2                 5  Life Sciences   33  Female        No
3                 8  Life Sciences   32    Male        No
4                11  Life Sciences   30    Male        No
..              ...            ...  ...     ...       ...
601            2046  Life Sciences   45  Female      None
602            2048  Life Sciences   40    Male      None
603            2049  Life Sciences   35    Male      None
604            2052  Life Sciences   35  Female      None
605            2064  Life Sciences   27    Male        No

[606 rows x 5 columns]

In [15]:
sales.to_sql("sales",sq.connect("hr.db"))
field.to_sql("field",sq.connect("hr.db"))

606

In [16]:
results = cur.execute("select name from sqlite_master where type='table'")
results.fetchall()

[('employee',), ('sales',), ('field',)]